
class World {
	public static final int WORLD_WIDTH = 200;	// 전체 맵 가로 크기(타일)
	public static final int WORLD_HEIGHT = 200;	// 전체 맵 세로 크기(타일)
	// 타일크기 = 65px >> 전체 크기 65 * 200 x 65 * 200
	// 전체 맵 = 13000px x 13000px
	
	int[][] map;		// 전체 맵 배열 (바다 영역)
	int[][] treeHP;		// 나무 HP (5번 배면 사라짐)
	int[][] rockHP;		// 돌 HP (사실상 무한)
	
	private final int[][] MAIN_ISLAND = new int[][]{
		// 0: 땅 | 1: 나무 하단 | 2: 나무 상단 | 3: 바다 | 4, 5: 불(꺼짐, 켜짐) | 6: 
		// 7: 정수기 | 8: 낚시터 | 9: 바다2(낚시)  | 10: 수풀 | 11: 배
		// 12: 강화
		// 13: 좌상단 모서리 | 14: 상단 가장자리 | 15: 우상단 모서리 | 16: 우측 가장자리
		// 17: 좌측 가장자리 | 18: 우하단 모서리 | 19: 좌하단 모서리 | 20: 하단 가장자리 
		// 21 ~ 24: 돌 | 25 ~ 28: 집
		{13,14,14,14,14,14,14,14,14,14,14,15},
		{17,0,10,0,0,2,0,0,0,0,0,16},
		{17,0,23,24,0,1,0,0,0,0,0,16},
		{17,0,22,21,0,0,0,0,0,0,0,16},
		{17,10,0,0,0,0,0,0,0,0,0,16},
		{17,10,0,23,24,0,0,0,0,0,0,16},
		{17,2,0,22,21,0,0,0,0,2,0,16},
		{17,1,0,0,0,0,0,0,0,1,0,16},
		{17,0,0,0,2,0,0,0,0,0,10,16},
		{17,2,0,0,1,0,0,0,10,10,10,16},
		{17,1,0,0,0,0,0,8,0,0,0,16},
		{19,20,20,20,20,20,20,9,20,20,20,18},
	};
	
	private final int[][] TREE_ISLAND = new int[][]{
		{3,13,14,14,14,14,14,14,14,14,14,15},
		{13,10,10,0,0,2,0,2,2,2,10,16},
		{17,0,2,2,0,1,0,1,1,1,0,16},
		{17,2,1,1,0,0,0,0,0,0,0,16},
		{17,1,0,0,0,0,2,2,0,0,0,16},
		{17,0,0,2,0,0,1,1,0,2,0,16},
		{17,2,2,1,0,0,0,0,0,1,0,16},
		{17,1,1,0,0,2,2,0,0,0,0,16},
		{17,0,0,0,0,1,1,0,2,0,10,16},
		{17,2,2,0,0,0,0,0,1,0,10,16},
		{17,1,1,10,10,10,0,0,0,0,10,16},
		{19,20,20,20,20,20,20,20,20,20,20,18},
	};
	
	private final int[][] ROCK_ISLAND = new int[][]{
		{13,14,14,14,14,14,14,14,14,14,14,15},
		{17,0,0,0,0,0,0,0,0,0,0,16},
		{17,0,0,23,24,0,0,0,0,0,0,16},
		{17,0,0,22,21,0,0,23,24,0,0,16},
		{17,0,0,0,0,0,0,22,21,0,0,16},
		{17,0,0,0,23,24,0,0,0,0,0,16},
		{17,0,0,0,22,21,0,0,0,0,0,16},
		{17,0,0,0,0,0,0,0,23,24,0,16},
		{17,0,23,24,0,0,0,0,22,21,0,16},
		{17,0,22,21,0,0,0,0,0,0,0,16},
		{17,0,0,0,0,0,0,0,0,0,0,16},
		{19,20,20,20,20,20,20,20,20,20,20,18},
	};
	
	
	World() {
		map = new int[WORLD_HEIGHT][WORLD_WIDTH];	// 200x200 바다 영역
		
		for (int i = 0; i < WORLD_HEIGHT; i++) {
			for (int j = 0; j < WORLD_WIDTH; j++) {
				map[i][j] = 3;		// 3번(바다)
			}
		}
		treeHP = new int[WORLD_HEIGHT][WORLD_WIDTH];
		rockHP = new int[WORLD_HEIGHT][WORLD_WIDTH];
		
		setIsland(MAIN_ISLAND, 60, 30);
		setIsland(TREE_ISLAND, 60, 70);
		setIsland(ROCK_ISLAND, 60, 110);
		
		setHP();
	}
	
	private void setIsland(int[][] a, int x, int y) {		
		
		for (int i = 0; i < a.length; i++) {	// 0 ~ 11
			int n = x + i;			// MAIN_ISLAND 기준 (60 ~ 71)
			
			for (int j = 0; j < a[0].length; j++) {
				int m = y + j;		// (30 ~ 41)
				
				map[n][m] = a[i][j];	
				// (60, 30) ~ (30, 41) 까지 덮어쓰기
			}
		}
	}

	
	private void setHP() {
		for (int i = 0; i < WORLD_HEIGHT; i++) {
			for (int j = 0; j<WORLD_WIDTH; j++) {
				if (map[i][j] == 1)		
					treeHP[i][j] = 5;
				if (map[i][j] >= 21 && map[i][j] <= 24)
					rockHP[i][j] = 2147483647;
			}
		}
	}
}
